---
kind: type
id: T:Autodesk.Revit.DB.ElementSet
source: html/48b47759-c441-ded2-5d8c-5c541c3eab01.htm
---
# Autodesk.Revit.DB.ElementSet

A set that contains element objects.

## Syntax (C#)
```csharp
public class ElementSet : APIObject, IEnumerable
```